# The Patient Puzzle

Source: https://msbiskills.com/2015/03/23/473/

In this puzzle we have to group data based on Patients admission date and discharge date. If any Patients discharge date + 1 = admission date then we have group both rows into one row and sum costs from both the rows. Please check out the sample input and expected output for details.

In [1]:
%run Question.ipynb

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
8 rows affected.
8 rows affected.

In [2]:
%%sql

SELECT * FROM patients;

 * postgresql://fknight:***@localhost/postgres
8 rows affected.

[(1009, datetime.date(2014, 7, 27), datetime.date(2014, 7, 31), '$1,050.00'),
 (1009, datetime.date(2014, 8, 1), datetime.date(2014, 8, 23), '$1,070.00'),
 (1009, datetime.date(2014, 8, 31), datetime.date(2014, 8, 31), '$1,900.00'),
 (1009, datetime.date(2014, 9, 1), datetime.date(2014, 9, 14), '$1,260.00'),
 (1009, datetime.date(2014, 12, 1), datetime.date(2014, 12, 31), '$2,090.00'),
 (1024, datetime.date(2014, 6, 7), datetime.date(2014, 6, 28), '$1,900.00'),
 (1024, datetime.date(2014, 6, 29), datetime.date(2014, 7, 31), '$2,900.00'),
 (1024, datetime.date(2014, 8, 1), datetime.date(2014, 8, 2), '$1,800.00')]

# Part A

To group consecutive admit & discharge dates, write a query that marks every consecutive hospital stay with a "1" as the start of the sequence, and a "0" afterwards.

## The expected output

|patientid|admissiondate|dischargedate|cost|start_of_seq|
|--- |--- |--- |--- |--- |
|1009|2014-07-27|2014-07-31|\$1,050.00|1|
|1009|2014-08-01|2014-08-23|\$1,070.00|0|
|1009|2014-08-31|2014-08-31|\$1,900.00|1|
|1009|2014-09-01|2014-09-14|\$1,260.00|0|
|1009|2014-12-01|2014-12-31|\$2,090.00|1|
|1024|2014-06-07|2014-06-28|\$1,900.00|1|
|1024|2014-06-29|2014-07-31|\$2,900.00|0|
|1024|2014-08-01|2014-08-02|\$1,800.00|0|

# Type your SQL below

In [ ]:
# %%sql
#
# Type your query here